In [6]:
import pandas as pd
import numpy as np

In [8]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [16]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [20]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [22]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [24]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [26]:
# working with dates

In [28]:
date['date'] = pd.to_datetime(date['date'])

In [30]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [34]:
#extract year

date['date_year'] = date['date'].dt.year

date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

In [44]:
date['date_month_name'] = date['date'].dt.month_name()

date['date_month_no'] = date['date'].dt.month


date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [46]:
#Extract Time Elapsed between dates

In [50]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 9, 25, 19, 30, 21, 221518)

In [52]:
today - date['date']

0     1751 days 19:30:21.221518
1     2233 days 19:30:21.221518
2     2164 days 19:30:21.221518
3     1866 days 19:30:21.221518
4     2089 days 19:30:21.221518
                 ...
995   2179 days 19:30:21.221518
996   2120 days 19:30:21.221518
997   1968 days 19:30:21.221518
998   2033 days 19:30:21.221518
999   1807 days 19:30:21.221518
Name: date, Length: 1000, dtype: timedelta64[ns]

In [54]:
# starts with time series

In [58]:
time.sample(10)

                    date                                                msg
17   2013-10-13 01:01:00  М.37 хочу общения с д/ж и не только. смс ммс з...
341  2012-07-12 00:16:00                       перезвоню девушке 0930186178
983  2016-10-03 23:26:00  ПАР ПОЗНАКОМИТЬСЯ С ХОРОШЕЙ ДЕВОЧКОЙ С КОММУНА...
813  2013-05-13 00:46:00   аха с д/ж Днепр  левый  м 40/120/192  0975931575
817  2013-11-25 01:20:00  ж 34 с ребенком ищу мужчину для аптеки!без обя...
63   2013-05-12 00:22:00  Д. 22 ищу состоятельного и интересного П. 0976...
725  2013-11-02 01:26:00  ПООБЩАЮСЬ С ДЕВУШКОЙ. 093 55 26 101. АДМИН ЗАД...
486  2015-02-05 00:12:00  ДЕВУШКА ПОЗНАКОМИТСЯ С ИНТЕРЕСНЫМ ПАРНЕМ ДЛЯ Д...
790  2012-08-08 00:34:00  ПАРЕНЬ ИЩЕТ ПЛОТН.ДРУГА ОТ 40 ЛЕТ.СМС О СЕБЕ 0...
558  2014-10-06 00:00:00  сумасшедшая капризная зато какая страстная нуж...

In [64]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [66]:
time['date'] = pd.to_datetime(time['date'])

In [68]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [70]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.hour
time['sec'] = time['date'].dt.hour